import Box from "../components/Box/Box";
import aboutbg from "../public/images/about/aboutbg.png";
import classes from "../styles/about.module.css";

const Boxes = {
    ourView: {title: "رؤيتنا", text: `الريادة لدى العملاء تعني الثقة بأننا الأفضل في مجال المفارش والمنتجات المنزلية.`},
    message: {title: "رسالتنا", text: `الوفاء بمسؤوليتنا تجاه رؤيتنا وتسخير كافة إمكانياتنا والاستفادة من تاريخنا وخبرتنا لتقديم مفارش ومنتجات منزلية أصلية بخدمة أفضل وجودة عالية وسعر مناسب، والتوصيل السريع لنحقق رضاء العملاء وأن نكون أفضل الموردين لهم في هذا المجال.`},
    goals: {title: "أهدافنا", text: `ضمان تقديم كافة خدمات المفارش والمنتجات المنزلية وفق معايير الجودة والكفاءة.
    سهولة الخدمات بما يحقق أعلى معدل لرضا العملاء أينما كانوا.
    تقديم خدمات الاستشارات المجانية الخاصة بالمفارش والمنتجات المنزلية بما يوازي حاجة العميل.
    الاستمرار بتطوير منتجاتنا وفتح أسواق جديدة في منطقة الخليج والعالم العربي.
    مواكبة حاجة السوق والعمل على الوفرة والتنوع في منتجاتنا وخدماتنا وحصرية تصاميمنا.
    المحافظة على المركز الأول وعلامتنا الرائدة في مجال المفارش والمنتجات المنزلية.
    الوصول لمرحلة التغطية الشاملة للسوق في المملكة العربية السعودية.`},
    ourValues:{ title: "قيمنا" , text: `العمل الجماعي. نحن نعمل بروح الفريق الواحد في كل ما نقوم به.
    الخدمة المتميزة. نحن تكمن سعادتنا في تقديم الخدمة الرفيعة لعملائنا وإرضائهم.
    التطوير المستمر. نحن ننمي روح التحسين والتجديد ومعرفة أحدث ما توصلت إليه المفارش والمنتجات المنزلية.
    الصدق والثقة. نحن نطبق أعلى المعايير الأخلاقية في تعاملنا وعلاقاتنا مع عملائنا.
    الإبداع والتميز. نحن نسعى لأن نكون مختلفين متميزين متفردين في منتجاتنا العصرية وتصاميمنا الحصرية.
    الآن نحن نعمل من منطلق الإحساس بضرورة الإنجاز السريع في توصيل منتجاتنا لعملائنا في كل مكان.`}

}
const About = () => {
    return (
        <div>
            <img className={classes.aboutbg} src={aboutbg.src} />
            <p className={classes.weAre}>نحن مجموعة من الشباب السوري المبدع بتوجيه محمد المطرجي</p>
            <Box title={Boxes.ourView.title} text={Boxes.ourView.text} />
            <Box title={Boxes.message.title} text={Boxes.message.text} />
            <Box title={Boxes.goals.title} text={Boxes.goals.text} />
            <Box title={Boxes.ourValues.title} text={Boxes.ourValues.text} />
        </div>
    )
}

export default About;